In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\Manoj\CODE\Python\Machine Learning\Data_Sets\Data preprocessing.csv")

In [3]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [5]:
df = df.interpolate()

In [6]:
df.describe()

             Age        Salary
count  10.000000     10.000000
mean   39.050000  63350.000000
std     7.304679  11642.952088
min    27.000000  48000.000000
25%    35.500000  55000.000000
50%    39.000000  60250.000000
75%    43.375000  70750.000000
max    50.000000  83000.000000

In [7]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [8]:
df.shape

(10, 4)

In [9]:
df['Age']=df['Age'].astype(int)

In [10]:
df.dtypes

Country       object
Age            int32
Salary       float64
Purchased     object
dtype: object

In [11]:
one_hot_encoded = pd.get_dummies(df['Purchased'])
df = pd.concat([df, one_hot_encoded], axis=1)
#df = df.join(one_hot_encoded)

In [12]:
df

   Country  Age   Salary Purchased  No  Yes
0   France   44  72000.0        No   1    0
1    Spain   27  48000.0       Yes   0    1
2  Germany   30  54000.0        No   1    0
3    Spain   38  61000.0        No   1    0
4  Germany   40  59500.0       Yes   0    1
5   France   35  58000.0       Yes   0    1
6    Spain   41  52000.0        No   1    0
7   France   48  79000.0       Yes   0    1
8  Germany   50  83000.0        No   1    0
9   France   37  67000.0       Yes   0    1